app/controllers/docs_controller.rb

  def index
    @docs = current_user.docs.order('id desc')
---
SELECT "docs".* FROM "docs" WHERE "docs"."user_id" = ? ORDER BY id desc  [["user_id", 1]]

  def create
    @doc = current_user.docs.build(doc_params)
    if @doc.save
---
INSERT INTO "docs" ("title", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)

  def find_doc
    @doc = params[:id].present? ? Doc.find(params[:id]) : Doc.new()
---
SELECT  "docs".* FROM "docs" WHERE "docs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]